Tekla Open API Reference for Tekla Structures 2025
DrawingLink Constructor (ViewBase, Point, Drawing, String)
 Creates a new drawing link instance using standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingLink(
	ViewBase View,
	Point InsertionPoint,
	Drawing Target,
	string Text
)
Public Sub New (
	View As ViewBase,
	InsertionPoint As Point,
	Target As Drawing,
	Text As String
)
Parameters
View
Type: Tekla.Structures.Drawing.ViewBase
A drawing view.
InsertionPoint
Type: Tekla.Structures.Geometry3d.Point
The location for the link.
Target
Type: Tekla.Structures.Drawing.Drawing
The link target.
Text
Type: System.String
The link text visible to the user.
See Also
Reference
DrawingLink Class
DrawingLink Overload
Tekla.Structures.Drawing Namespace